"""
Задача 02-07. Оценка по баллам

Прочитайте количество баллов (целое число от 0 до 100) и выведите оценку:

- 90 и больше — «отлично»;
- от 75 до 89 — «хорошо»;
- от 60 до 74 — «удовлетворительно»;
- меньше 60 — «неудовлетворительно».

Пример
------
Ввод:
95
Вывод:
отлично
"""

# TODO: прочитайте балл и выведите оценку по шкале
a = int(input())
if a>=90 and a<=100:
    print('Отлично')
elif a>=75 and a<=89:
    print('хорошо')
elif a>=60 and a<=74:
    print('удовлетворительно')
elif a>=60:
    print('неудовлетворительно')
else:
    print('ОШИБКА')
