"""
Задача 02-16. Время года

Прочитайте порядковый номер месяца (целое число). Выведите время года:

- 12, 1, 2 — «зима»;
- 3, 4, 5 — «весна»;
- 6, 7, 8 — «лето»;
- 9, 10, 11 — «осень»;
- любой другой номер — «ошибка».

Пример
------
Ввод:
4
Вывод:
весна
"""

# TODO: прочитайте номер месяца и выведите время года
z = int(input())

if z == 12 or z == 1 or z == 2:
    print('зима')
if z == 3 or z == 4 or z == 5:
    print('весна')
if z == 6 or z == 7 or z == 8:
    print('лето')
if z == 9 or z == 10 or z == 11:
    print('осень')